n5/src/BusinessProcesses/SalesOrder/SalesOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>SalesOrder</name>
  <task>Task.Task</task>
  <attributes>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

n5/src/InformationRegisters/SalesOrderStatuses/SalesOrderStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SalesOrderStatuses</name>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.SalesOrderPoints</types>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Enums/SalesOrderPoints/SalesOrderPoints.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SalesOrderPoints</name>
  <enumValues>
    <name>All</name>
  </enumValues>
  <enumValues>
    <name>DepartmentHeadResolution</name>
  </enumValues>
  <enumValues>
    <name>Finish</name>
  </enumValues>
  <enumValues>
    <name>Invoicing</name>
  </enumValues>
  <enumValues>
    <name>New</name>
  </enumValues>
  <enumValues>
    <name>Reject</name>
  </enumValues>
  <enumValues>
    <name>Rework</name>
  </enumValues>
  <enumValues>
    <name>Shipping</name>
  </enumValues>
</mdclass:Enum>

n5/src/Documents/Shipment/Shipment.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Shipment</name>
  <posting>Deny</posting>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>SO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Tax</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxableAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRate</name>
    <type>
      <types>DefinedType.TaxRate</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>CapacityPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrderRowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>PackagePlan</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Picked</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Reservation</name>
      <type>
        <types>EnumRef.Reservation</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Stock</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Taxes</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.TaxItems</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/BusinessProcesses/SalesOrder/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure HeadShouldApprove ( BusinessProcessRoutePoint, Result )
	
	data = DF.Values ( SalesOrder, "Customer.ApproveSalesOrders as A1, Creator.ApproveSalesOrders as A2" );
	Result = data.A1 or data.A2;
	
EndProcedure

Procedure DepartmentHeadResolutionOnCreateTask ( BusinessProcessRoutePoint, TasksBeingFormed, Cancel )
	
	setStatus ( BusinessProcessRoutePoint );
	setDepartment ( TasksBeingFormed );
	
EndProcedure

Procedure setStatus ( RoutePoint ) export
	
	record = InformationRegisters.SalesOrderStatuses.CreateRecordManager ();
	record.Document = SalesOrder;
	record.Status = getStatus ( RoutePoint );
	record.Write ();
	
EndProcedure 

Function getStatus ( RoutePoint )
	
	routePoints = BusinessProcesses.SalesOrder.RoutePoints;
	if ( RoutePoint = routePoints.DepartmentHeadResolution ) then
		return Enums.SalesOrderPoints.DepartmentHeadResolution;
	elsif ( RoutePoint = routePoints.Reject ) then
		return Enums.SalesOrderPoints.Reject;
	elsif ( RoutePoint = routePoints.Shipping ) then
		return Enums.SalesOrderPoints.Shipping;
	elsif ( RoutePoint = routePoints.Finish ) then
		return Enums.SalesOrderPoints.Finish;
	elsif ( RoutePoint = routePoints.Rework ) then
		return Enums.SalesOrderPoints.Rework;
	elsif ( RoutePoint = routePoints.Invoicing ) then
		return Enums.SalesOrderPoints.Invoicing;
	endif; 
	
EndFunction 

Procedure setDepartment ( Tasks )
	
	department = DF.Pick ( SalesOrder, "Department" );
	for each task in Tasks do
		task.Department = department;
	enddo; 
	
EndProcedure 

Procedure ResolutionSwitcher ( SwitchPoint, Result )
	
	resolution = DF.Pick ( SalesOrder, "Resolution" );
	if ( resolution = Enums.Resolutions.Approve ) then
		//@skip-warning
		Result = SwitchPoint.Cases.Allow;
	elsif ( resolution = Enums.Resolutions.Reject ) then
		//@skip-warning
		Result = SwitchPoint.Cases.Reject;
	elsif ( resolution = Enums.Resolutions.Rework ) then
		//@skip-warning
		Result = SwitchPoint.Cases.Rework;
	endif; 
	
EndProcedure

Procedure OnCreateTask ( BusinessProcessRoutePoint, TasksBeingFormed, Cancel )
	
	Documents.Shipment.Create ( SalesOrder );
	setStatus ( BusinessProcessRoutePoint );
	
EndProcedure

Procedure OnCreateTaskForUser ( BusinessProcessRoutePoint, TasksBeingFormed, Cancel )
	
	setStatus ( BusinessProcessRoutePoint );
	setUser ( TasksBeingFormed );
	
EndProcedure

Procedure setUser ( Tasks )
	
	creator = DF.Pick ( SalesOrder, "Creator" );
	for each task in Tasks do
		task.User = creator;
	enddo; 
	
EndProcedure 

Procedure CheckServices ( BusinessProcessRoutePoint, Result )
	
	Result = servicesOnly ();
	
EndProcedure

Function servicesOnly ()
	
	s = "
	|select top 1 false as Services
	|from Document.SalesOrder.Items as Items
	|where Items.Ref = &SalesOrder
	|union all
	|select top 1 true
	|from Document.SalesOrder.Services as Services
	|where Services.Ref = &SalesOrder
	|";
	q = new Query ( s );
	q.SetParameter ( "SalesOrder", SalesOrder );
	table = q.Execute ().Unload ();
	return table.Count () = 1 and table [ 0 ].Services;
	
EndFunction 

Procedure ShippingCheckExecutionProcessing ( BusinessProcessRoutePoint, Task, Result )
	
	Result = Documents.SalesOrder.ShippingComplete ( SalesOrder );
	
EndProcedure

Procedure FinishOnComplete ( BusinessProcessRoutePoint, Cancel )
	
	setStatus ( BusinessProcessRoutePoint );
	
EndProcedure

Procedure CheckShipment ( BusinessProcessRoutePoint, Result )
	
	Result = DF.Pick ( SalesOrder, "Department.Shipments" );

EndProcedure

#endif
